In [1]:
#datetime library
from datetime import datetime

In [2]:
my_year = 2024
my_month = 8
my_day = 25
my_hour = 11
my_minute = 12
my_seconds = 35

In [5]:
my_timestamp = datetime(my_year,my_month,my_day,my_hour,my_minute,my_seconds)

In [8]:
my_timestamp.day

25

In [9]:
my_timestamp.hour

11

In [35]:
import pandas as pd

myser = pd.Series(['Aug 25, 2024','2024-6-6',None])

In [36]:
type(myser[0])

str

In [37]:
ts = pd.to_datetime(myser,format='mixed')

In [26]:
ts[0]

Timestamp('2024-08-25 00:00:00')

In [27]:
sample_date = '10-12-2024'

#10th of Dec or 12th of October?

In [28]:
pd.to_datetime(sample_date)

Timestamp('2024-10-12 00:00:00')

In [29]:
pd.to_datetime(sample_date,dayfirst=True)

Timestamp('2024-12-10 00:00:00')

In [31]:
#custom time string formatting

style = '25--Aug---2024'

pd.to_datetime(style, format = '%d--%b---%Y')

Timestamp('2024-08-25 00:00:00')

In [40]:
style1 = '2024-06-06'



pd.to_datetime(style1, format = '%Y-%d-%m')

Timestamp('2024-06-06 00:00:00')

In [43]:
ts3 = datetime.strptime('31/01/22 23:59:59','%d/%m/%y %H:%M:%S')

In [45]:
ts3.weekday

In [46]:
#import dataset
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [49]:
type(sales.iloc[0]['DATE'])

str

In [51]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [52]:
type(sales.iloc[0]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp

In [55]:
#parse column at index 0 as DateTime
sales1 = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])
sales1

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [56]:
type(sales1.iloc[0]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp

In [59]:
sales1['Month'] = sales1['DATE'].dt.month

In [62]:
sales1['Quarter'] = sales1['DATE'].dt.quarter

In [63]:
sales1

          DATE  MRTSSM4453USN  Month  Quarter
0   1992-01-01           1509      1        1
1   1992-02-01           1541      2        1
2   1992-03-01           1597      3        1
3   1992-04-01           1675      4        2
4   1992-05-01           1822      5        2
..         ...            ...    ...      ...
335 2019-12-01           6630     12        4
336 2020-01-01           4388      1        1
337 2020-02-01           4533      2        1
338 2020-03-01           5562      3        1
339 2020-04-01           5207      4        2

[340 rows x 4 columns]

In [69]:
#help(sales1['DATE'].dt)

In [68]:
sales1['DATE'].dt.isocalendar()

     year  week  day
0    1992     1    3
1    1992     5    6
2    1992     9    7
3    1992    14    3
4    1992    18    5
..    ...   ...  ...
335  2019    48    7
336  2020     1    3
337  2020     5    6
338  2020     9    7
339  2020    14    3

[340 rows x 3 columns]